tube/tube_r0.75mm_l15cm_5mlpmin_11cells_snappy/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Dimensions means physical dimensions with respect to the SI unit system
// Number is exponent
//      SI [  kg   m   s   K mol   A  cd]
dimensions [   0   1  -1   0   0   0   0];

internalField uniform (0 0 0);

boundaryField
{
    outlet
    {
        type zeroGradient;
    }

    inlet
    {
        type flowRateInletVelocity;
        volumetricFlowRate 0.0000000833 // Volumetric/mass flow rate [m3/s or kg/s]
            value uniform (0 0 0); // placeholder
        extrapolateProfile false;
    }

    tubePatch
    {
        type fixedValue;
        value uniform (0 0 0);
    }
}
